app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all
---
SELECT * FROM "contacts"

  def create
    @contact = Contact.new(params[:contact])
    if @contact.save
---
INSERT INTO "contacts" ("name", "created_at", "updated_at", "email") VALUES('adf', '2009-12-04 06:44:19', '2009-12-04 06:44:19', 'asdf')

  def edit
    @contact = Contact.find(params[:id])
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)

  def update
    @contact = Contact.find(params[:id])
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)

  def delete
    @contact = Contact.find(params[:id])
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = 69)

  def destroy
    @contact = Contact.find(params[:id])
    redirect_to(@contact) and return if params[:cancel]
    @contact.destroy
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = 2)
DELETE FROM "contacts" WHERE "id" = 2